doc/2014-08-08-Some-trivial-examples-of-using-Clojure-Transducers.org
#+Title: Some trivial examples of using Clojure Transducers
#+tags: clojure transducers reducers
#+options: H:4 toc:2
#+options: ^:{}
#+STARTUP: hidestars
#+TAGS: noexport(e)
#+EXPORT_EXCLUDE_TAGS: noexport
#+OCTOPRESS_CATEGORIES: clojure transducers reducers
#+OCTOPRESS_COMMENTS: Some trivial examples of using Clojure Transducers
#+BEGIN_QUOTE
TL;DR: first take on Clojure's new Transducers
#+END_QUOTE

* Introduction

[Rich Hickey][HickeyTwitter] published a [post][HickeyBlogTransducers6Aug14] a few days ago on the
forthcoming [Transducers][HickeyBlogTransducers6Aug14]. 

*Transducers* should make their first appearance in [Clojure][ClojureHome] _1.7.0_
and the examples below were run using _1.7.0-alpha1_

The first paragraph of Rich's post describes *Transducers* as:

#+BEGIN_QUOTE
Transducers are a powerful and composable way to build algorithmic
transformations that you can reuse in many contexts, and they're
coming to Clojure core and core.async.
#+END_QUOTE

Rich also says:

#+BEGIN_QUOTE
The other source of power comes from the fact that transducers compose using ordinary function composition.
#+END_QUOTE

*Transducers* follow on from *Reducers*, first
[announced][HickeyBlogReducers18May12] by Rich in
May 2012.

I wrote a post back in late 2012 called [Some trivial examples of
using Clojure Reducers][RumfordBlogTrivialReducers17Nov12] in which I
attempted to offer some practical, if contrived, examples of how to
use *reducers*.

This post reprises the examples in the [reducers post][RumfordBlogTrivialReducers17Nov12] but now includes
equivalent contrived *transducers* examples as well.

I've includes some material from the [reducers post][RumfordBlogTrivialReducers17Nov12] for completeness, but without
any explanation, so you don't have to flip between the two. But you may
want to refer to the [reducers post][RumfordBlogTrivialReducers17Nov12] for *reducers* background.

#+BEGIN_SRC
<!-- more -->
#+END_SRC

* The Code

** The Code - repo is on Github

The repo with the example code can be found on
[Github][RumfordGithubClojureTransducerExamples].  Its a
[Leiningen][LeiningenHome] project.

** The Code - running the examples

Run the examples in the usual way

#+BEGIN_SRC sh :tangle :no
lein run -m transducers-examples1
#+END_SRC

** The Code - code is a tangled org-mode file

The source code and _project.clj_ are generated (tangled) from the
org-mode source of this post found in the _doc_ folder.

** The Code - misc

The *reducers* namespace is _r_ in the examples below i.e.

#+BEGIN_SRC clojure :tangle :no
[clojure.core.reducers :as r]
#+END_SRC

There is no need to _require_  *transducers*.

#+BEGIN_SRC clojure :mkdirp yes :exports none :tangle ../src/main/clojure/transducer_examples1.clj
(ns transducer-examples1
  (:require 
   [clojure.string :as string]
   [clojure.core.reducers :as r]))
#+END_SRC

