doc/2014-08-08-Some-trivial-examples-of-using-Clojure-Transducers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Some trivial examples of using Clojure Transducers</title>
<!-- 2014-08-08 Fri 15:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ian Rumford" />
</head>
<body>
<div id="content">
<h1 class="title">Some trivial examples of using Clojure Transducers</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. The Code</a>
<ul>
<li><a href="#sec-2-1">2.1. The Code - repo is on Github</a></li>
<li><a href="#sec-2-2">2.2. The Code - running the examples</a></li>
<li><a href="#sec-2-3">2.3. The Code - code is a tangled org-mode file</a></li>
<li><a href="#sec-2-4">2.4. The Code - misc</a></li>
</ul>
</li>
<li><a href="#sec-3">3. The Examples Collection</a></li>
<li><a href="#sec-4">4. Example 1 - how many children in the village?</a>
<ul>
<li><a href="#sec-4-1">4.1. Example 1a - using a reducer to count how many children in the village</a></li>
<li><a href="#sec-4-2">4.2. Example 1b - using a transducer to count how many children in the village</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Example 2 - how many children in the Brown family?</a>
<ul>
<li><a href="#sec-5-1">5.1. Example 2a - using a reducer to count the children in the Brown family</a></li>
<li><a href="#sec-5-2">5.2. Example 2b - using a transducer to count the children in the Brown family</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Example 3 - how many children's names start with J?</a>
<ul>
<li><a href="#sec-6-1">6.1. Example 3a - using a reducer to count children with names beginning with J</a></li>
<li><a href="#sec-6-2">6.2. Example 3b - using a transducer to count children with names beginning with J</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Example 4 - creating a collection of children whose names start with J?</a>
<ul>
<li><a href="#sec-7-1">7.1. Example 4a - using a reducer to create a collection of children whose names start with J?</a></li>
<li><a href="#sec-7-2">7.2. Example 4b - using a transducer to create a collection of children whose names start with J?</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Example 5 - calculate the average age of children on or below the equator</a>
<ul>
<li><a href="#sec-8-1">8.1. Example 5a - using a reducer to calculate the average age of children on or below the equator</a></li>
<li><a href="#sec-8-2">8.2. Example 5b - using a transducer to calculate the average age of children on or below the equator</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Example 6 - comparing the performance of reducers and transducers</a>
<ul>
<li><a href="#sec-9-1">9.1. Example 6a - time a reducer adding up Example 5's ages</a></li>
<li><a href="#sec-9-2">9.2. Example 6b - time a transducer adding up Example 5's ages</a></li>
</ul>
</li>
<li><a href="#sec-10">10. Example 7 - all the relatives visit the village!</a>
<ul>
<li><a href="#sec-10-1">10.1. Example 7 - make some visitors</a></li>
<li><a href="#sec-10-2">10.2. Example 7a - using reducers to count the visiting Brown children</a></li>
<li><a href="#sec-10-3">10.3. Example 7b - using transducers to count the visiting Brown children</a></li>
<li><a href="#sec-10-4">10.4. Example 7c - using core map, filter and reduce to count the visiting Brown children</a></li>
</ul>
</li>
<li><a href="#sec-11">11. Final Words</a></li>
</ul>
</div>
</div>
<blockquote>
<p>
TL;DR: first take on Clojure's new Transducers
</p>
</blockquote>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
[Rich Hickey][HickeyTwitter] published a [post][HickeyBlogTransducers6Aug14] a few days ago on the
forthcoming [Transducers][HickeyBlogTransducers6Aug14]. 
</p>

<p>
<b>Transducers</b> should make their first appearance in [Clojure][ClojureHome] <span class="underline">1.7.0</span>
and the examples below were run using <span class="underline">1.7.0-alpha1</span>
</p>

<p>
The first paragraph of Rich's post describes <b>Transducers</b> as:
</p>

<blockquote>
<p>
Transducers are a powerful and composable way to build algorithmic
transformations that you can reuse in many contexts, and they're
coming to Clojure core and core.async.
</p>
</blockquote>

<p>
Rich also says:
</p>

<blockquote>
<p>
The other source of power comes from the fact that transducers compose using ordinary function composition.
</p>
</blockquote>

<p>
<b>Transducers</b> follow on from <b>Reducers</b>, first
[announced][HickeyBlogReducers18May12] by Rich in
May 2012.
</p>

<p>
I wrote a post back in late 2012 called [Some trivial examples of
using Clojure Reducers][RumfordBlogTrivialReducers17Nov12] in which I
attempted to offer some practical, if contrived, examples of how to
use <b>reducers</b>.
</p>

<p>
This post reprises the examples in the [reducers post][RumfordBlogTrivialReducers17Nov12] but now includes
equivalent contrived <b>transducers</b> examples as well.
</p>

<p>
I've includes some material from the [reducers post][RumfordBlogTrivialReducers17Nov12] for completeness, but without
any explanation, so you don't have to flip between the two. But you may
want to refer to the [reducers post][RumfordBlogTrivialReducers17Nov12] for <b>reducers</b> background.
</p>

<pre class="example">
&lt;!-- more --&gt;
</pre>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The Code</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> The Code - repo is on Github</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The repo with the example code can be found on
[Github][RumfordGithubClojureTransducerExamples].  Its a
[Leiningen][LeiningenHome] project.
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> The Code - running the examples</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Run the examples in the usual way
</p>

<div class="org-src-container">

<pre class="src src-sh">lein run -m transducers-examples1
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> The Code - code is a tangled org-mode file</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The source code and <span class="underline">project.clj</span> are generated (tangled) from the
org-mode source of this post found in the <span class="underline">doc</span> folder.
</p>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> The Code - misc</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The <b>reducers</b> namespace is <span class="underline">r</span> in the examples below i.e.
</p>

<div class="org-src-container">

<pre class="src src-clojure">[<span style="color: #228b22;">clojure.core.reducers</span> <span style="color: #008b8b;">:as</span> r]
</pre>
</div>

<p>
There is no need to <span class="underline">require</span>  <b>transducers</b>.
</p>
</div>
</div>
</div>
