doc/2014-08-08-Some-trivial-examples-of-using-Clojure-Transducers.org
* The Examples Collection

Many of the following examples will use the same collection
holding the population of a small village.  The village
has four families, some families have two parents, others one; and
each family between one and three children.  One family lives in the North, and one each in the South, East and West.

_This is stylised, artificial and contrived data designed to be easily understandable to most and in no way intended to suggest any family structures, conventions or arrangements as socially preferable.  Just saying._

#+BEGIN_SRC clojure  :tangle ../src/main/clojure/transducer_examples1.clj
;; The Families in the Village

(def village
  [{:home :north :family "smith" :name "sue" :age 37 :sex :f :role :parent}
   {:home :north :family "smith" :name "stan" :age 35 :sex :m :role :parent}
   {:home :north :family "smith" :name "simon" :age 7 :sex :m :role :child}
   {:home :north :family "smith" :name "sadie" :age 5 :sex :f :role :child}
   
   {:home :south :family "jones" :name "jill" :age 45 :sex :f :role :parent}
   {:home :south :family "jones" :name "jeff" :age 45 :sex :m :role :parent}
   {:home :south :family "jones" :name "jackie" :age 19 :sex :f :role :child}
   {:home :south :family "jones" :name "jason" :age 16 :sex :f :role :child}
   {:home :south :family "jones" :name "june" :age 14 :sex :f :role :child}

   {:home :west :family "brown" :name "billie" :age 55 :sex :f :role :parent}
   {:home :west :family "brown" :name "brian" :age 23 :sex :m :role :child}
   {:home :west :family "brown" :name "bettie" :age 29 :sex :f :role :child}
   
   {:home :east :family "williams" :name "walter" :age 23 :sex :m :role :parent}
   {:home :east :family "williams" :name "wanda" :age 3 :sex :f :role :child}])
#+END_SRC

* Example 1 - how many children in the village?

An obvious way to do this would be to _map_  each child to the value
1, else 0.  The total number of children is then the simple addition
of the 1s & 0s results of the map operation.

** Example 1a - using a reducer to count how many children in the village

The *reducers* way looks like this:

#+BEGIN_SRC clojure :mkdirp yes :tangle ../src/main/clojure/transducer_examples1.clj
;; Example 1a - using a reducer to add up all the mapped values

(def ex1a-map-children-to-value-1 (r/map #(if (= :child (:role %)) 1 0)))

(r/reduce + 0 (ex1a-map-children-to-value-1 village))
;;=>
8
#+END_SRC

** Example 1b - using a transducer to count how many children in the village
   
The *transducers* way looks very similar. Literally the only difference is to use *core* map
rather than the *reducers* map.

First the _transducer_
function _ex1b-map-children-to-value-1_ is created using the new
arity for _map_ that takes just the mapping function, no
collection. 

Then the _transducer_ is used with the new *transduce* function to
reduce the collection and return the answer. *transduce* take the _transducer_
function as its first argument, then the "usual" reducer arguments
of reducing function, initial value and collection. 

#+BEGIN_SRC clojure :mkdirp yes :tangle ../src/main/clojure/transducer_examples1.clj
;; Example 1b - using a transducer to add up all the mapped values

;; create the transducers using the new arity for map that
;; takes just the function, no collection

(def ex1b-map-children-to-value-1 (map #(if (= :child (:role %)) 1 0)))

;; now use transduce (c.f r/reduce) with the transducer to get the answer 
(transduce ex1b-map-children-to-value-1 + 0 village)
;;=>
8
#+END_SRC


