doc/2014-08-08-Some-trivial-examples-of-using-Clojure-Transducers.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The Examples Collection</h2>
<div class="outline-text-2" id="text-3">
<p>
Many of the following examples will use the same collection
holding the population of a small village.  The village
has four families, some families have two parents, others one; and
each family between one and three children.  One family lives in the North, and one each in the South, East and West.
</p>

<p>
<span class="underline">This is stylised, artificial and contrived data designed to be easily understandable to most and in no way intended to suggest any family structures, conventions or arrangements as socially preferable.  Just saying.</span>
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">The Families in the Village</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">village</span>
  [{<span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:north</span> <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"smith"</span> <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"sue"</span> <span style="color: #008b8b;">:age</span> 37 <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:f</span> <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:parent</span>}
   {<span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:north</span> <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"smith"</span> <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"stan"</span> <span style="color: #008b8b;">:age</span> 35 <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:m</span> <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:parent</span>}
   {<span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:north</span> <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"smith"</span> <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"simon"</span> <span style="color: #008b8b;">:age</span> 7 <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:m</span> <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:child</span>}
   {<span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:north</span> <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"smith"</span> <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"sadie"</span> <span style="color: #008b8b;">:age</span> 5 <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:f</span> <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:child</span>}

   {<span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:south</span> <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"jones"</span> <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"jill"</span> <span style="color: #008b8b;">:age</span> 45 <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:f</span> <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:parent</span>}
   {<span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:south</span> <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"jones"</span> <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"jeff"</span> <span style="color: #008b8b;">:age</span> 45 <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:m</span> <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:parent</span>}
   {<span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:south</span> <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"jones"</span> <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"jackie"</span> <span style="color: #008b8b;">:age</span> 19 <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:f</span> <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:child</span>}
   {<span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:south</span> <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"jones"</span> <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"jason"</span> <span style="color: #008b8b;">:age</span> 16 <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:f</span> <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:child</span>}
   {<span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:south</span> <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"jones"</span> <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"june"</span> <span style="color: #008b8b;">:age</span> 14 <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:f</span> <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:child</span>}

   {<span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:west</span> <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"brown"</span> <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"billie"</span> <span style="color: #008b8b;">:age</span> 55 <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:f</span> <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:parent</span>}
   {<span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:west</span> <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"brown"</span> <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"brian"</span> <span style="color: #008b8b;">:age</span> 23 <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:m</span> <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:child</span>}
   {<span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:west</span> <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"brown"</span> <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"bettie"</span> <span style="color: #008b8b;">:age</span> 29 <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:f</span> <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:child</span>}

   {<span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:east</span> <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"williams"</span> <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"walter"</span> <span style="color: #008b8b;">:age</span> 23 <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:m</span> <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:parent</span>}
   {<span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:east</span> <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"williams"</span> <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"wanda"</span> <span style="color: #008b8b;">:age</span> 3 <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:f</span> <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:child</span>}]<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Example 1 - how many children in the village?</h2>
<div class="outline-text-2" id="text-4">
<p>
An obvious way to do this would be to <span class="underline">map</span>  each child to the value
1, else 0.  The total number of children is then the simple addition
of the 1s &amp; 0s results of the map operation.
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Example 1a - using a reducer to count how many children in the village</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The <b>reducers</b> way looks like this:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example 1a - using a reducer to add up all the mapped values</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex1a-map-children-to-value-1</span> <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">r</span>/map #<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">if</span> <span style="color: #8c8c8c;">(</span>= <span style="color: #008b8b;">:child</span> <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:role</span> <span style="color: #a0522d;">%</span><span style="color: #8c8c8c;">))</span> 1 0<span style="color: #8c8c8c;">)))</span>

<span style="color: #8c8c8c;">(</span><span style="color: #228b22;">r</span>/reduce + 0 <span style="color: #8c8c8c;">(</span>ex1a-map-children-to-value-1 village<span style="color: #8c8c8c;">))</span>
<span style="color: #006400;">;;</span><span style="color: #006400;">=&gt;</span>
8
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Example 1b - using a transducer to count how many children in the village</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The <b>transducers</b> way looks very similar. Literally the only difference is to use <b>core</b> map
rather than the <b>reducers</b> map.
</p>

<p>
First the <span class="underline">transducer</span>
function <span class="underline">ex1b-map-children-to-value-1</span> is created using the new
arity for <span class="underline">map</span> that takes just the mapping function, no
collection. 
</p>

<p>
Then the <span class="underline">transducer</span> is used with the new <b>transduce</b> function to
reduce the collection and return the answer. <b>transduce</b> take the <span class="underline">transducer</span>
function as its first argument, then the "usual" reducer arguments
of reducing function, initial value and collection. 
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example 1b - using a transducer to add up all the mapped values</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">create the transducers using the new arity for map that</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">takes just the function, no collection</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex1b-map-children-to-value-1</span> <span style="color: #8c8c8c;">(</span>map #<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">if</span> <span style="color: #8c8c8c;">(</span>= <span style="color: #008b8b;">:child</span> <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:role</span> <span style="color: #a0522d;">%</span><span style="color: #8c8c8c;">))</span> 1 0<span style="color: #8c8c8c;">)))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">now use transduce (c.f r/reduce) with the transducer to get the answer </span>
<span style="color: #8c8c8c;">(</span>transduce ex1b-map-children-to-value-1 + 0 village<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;;</span><span style="color: #006400;">=&gt;</span>
8
</pre>
</div>
</div>
</div>
</div>
