doc/2014-08-08-Some-trivial-examples-of-using-Clojure-Transducers.org
* Example 2 - how many children in the Brown family?

An obvious way to find how many children just in the Brown family
would be to select ( _filter_) the members of the Brown family, and
use the same _map_ function - e.g. _ex1a-map-children-to-value-1_ - from
Example 1 to count the children.

** Example 2a - using a reducer to count the children in the Brown family

Along with _map_, *reducers* have a _filter_ function that returns another function that can be used with _reduce_:

#+BEGIN_SRC clojure :mkdirp yes :tangle ../src/main/clojure/transducer_examples1.clj
;; Example 2a - using a reducer to count the children in the Brown family

;; create the reducer to select members of the Brown family
(def ex2a-select-brown-family (r/filter #(= "brown" (string/lower-case (:family %)))))

;; compose a composite function to select the Brown family and map children to 1
(def ex2a-count-brown-family-children (comp ex1a-map-children-to-value-1 ex2a-select-brown-family))

;; reduce to add up all the Brown children
(r/reduce + 0 (ex2a-count-brown-family-children village))
;;=>
2
#+END_SRC

Its worth observing *reducers* _reduce_ does *not* need to create
any intermediate collections.

** Example 2b - using a transducer to count the children in the Brown family

The transducer-aware *core*  _filter_ function can be used to select
the Brown family members, while the  _transducer_
_ex1b-map-children-to-value-1_ can be used to map children to 1, else 0.

As with *reducers*, the two functions _ex2b-select-brown-family_
and _ex1b-map-children-to-value-1_ can be composed together.

And as before, *transduce* is used to count (reduce) the number of children.

#+BEGIN_SRC clojure :mkdirp yes :tangle ../src/main/clojure/transducer_examples1.clj
;; Example 2b - using a transducer to count the children in the Brown family

;; create the transducer filter to select members of the Brown family
(def ex2b-select-brown-family (filter #(= "brown" (string/lower-case (:family %)))))

;; compose a composite function to select the Brown family and map children to 1
;; NOTE: transducer comp functions are applied left-to-right
(def ex2b-count-brown-family-children (comp ex2b-select-brown-family ex1b-map-children-to-value-1))

;; transduce to add up all the Brown children
(transduce ex2b-count-brown-family-children + 0 village)
;;=>
2
#+END_SRC

#+BEGIN_QUOTE
Note there is a gotcha here.  The functions in the composed
transducer ex2b-count-brown-family-children are
applied left-to-right not right-to-left as is usual with comp.
#+END_QUOTE

Although not explicitly stated in Rich's
[post][HickeyBlogTransducers6Aug14] I guess *transducers*
do not create intermediate collections either.

* Example 3 - how many children's names start with J?

We already know the answer:  just the 3 children in the _Jones_ family.

Algorithmically, this is a three step pipeline: _filter_ on children, a _filter_ on
names beginning with "J" (or "j") and finally count of how many (children) in the result.

** Example 3a - using a reducer to count children with names beginning with J

#+BEGIN_SRC clojure :mkdirp yes :tangle ../src/main/clojure/transducer_examples1.clj
;; Example 3a - using a reducer to count children with names beginning with J

;; select (filter) just the children
(def ex3a-select-children (r/filter #(= :child (:role %))))

;; select names beginning with "j"
(def ex3a-select-names-beginning-with-j (r/filter #(= "j" (string/lower-case (first (:name %))))))

;; In Example 1 we created the _map_ function
;; ex1a-map-children-to-value-1 to enable reduce to count the number
;; of children.

;; But the need to count the number of entries in a collection using
;; reduce, after a pipeline possibly involving many filters and
;; mappers, is a common one. This is straightforward to do, in the final
;; stage of the pipeline use a map function to transform each entry to
;; value 1.

;; map entries in a collection to 1
(def ex0a-map-to-value-1 (r/map (fn [v] 1)))

;; create the three step count-children-with-names-beginning-j function
(def ex3a-count-children-with-names-beginning-j (comp ex0a-map-to-value-1
                                                      ex3a-select-names-beginning-with-j
                                                      ex3a-select-children))

;; reduce the village with the ex32-count-children-with-names-beginning-j function
(r/reduce + 0 (ex3a-count-children-with-names-beginning-j village))
;; =>
3
#+END_SRC


Its worth labouring the point that composing the custom reducer _count-children-with-names-beginning-js_ from
individual _filters_ and _mappers_ is a very powerful technique.

