doc/2014-08-08-Some-trivial-examples-of-using-Clojure-Transducers.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Example 2 - how many children in the Brown family?</h2>
<div class="outline-text-2" id="text-5">
<p>
An obvious way to find how many children just in the Brown family
would be to select ( <span class="underline">filter</span>) the members of the Brown family, and
use the same <span class="underline">map</span> function - e.g. <span class="underline">ex1a-map-children-to-value-1</span> - from
Example 1 to count the children.
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Example 2a - using a reducer to count the children in the Brown family</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Along with <span class="underline">map</span>, <b>reducers</b> have a <span class="underline">filter</span> function that returns another function that can be used with <span class="underline">reduce</span>:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example 2a - using a reducer to count the children in the Brown family</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">create the reducer to select members of the Brown family</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex2a-select-brown-family</span> <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">r</span>/filter #<span style="color: #8c8c8c;">(</span>= <span style="color: #8b2252;">"brown"</span> <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">string</span>/lower-case <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:family</span> <span style="color: #a0522d;">%</span><span style="color: #8c8c8c;">)))))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">compose a composite function to select the Brown family and map children to 1</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex2a-count-brown-family-children</span> <span style="color: #8c8c8c;">(</span>comp ex1a-map-children-to-value-1 ex2a-select-brown-family<span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">reduce to add up all the Brown children</span>
<span style="color: #8c8c8c;">(</span><span style="color: #228b22;">r</span>/reduce + 0 <span style="color: #8c8c8c;">(</span>ex2a-count-brown-family-children village<span style="color: #8c8c8c;">))</span>
<span style="color: #006400;">;;</span><span style="color: #006400;">=&gt;</span>
2
</pre>
</div>

<p>
Its worth observing <b>reducers</b> <span class="underline">reduce</span> does <b>not</b> need to create
any intermediate collections.
</p>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Example 2b - using a transducer to count the children in the Brown family</h3>
<div class="outline-text-3" id="text-5-2">
<p>
The transducer-aware <b>core</b>  <span class="underline">filter</span> function can be used to select
the Brown family members, while the  <span class="underline">transducer</span>
<span class="underline">ex1b-map-children-to-value-1</span> can be used to map children to 1, else 0.
</p>

<p>
As with <b>reducers</b>, the two functions <span class="underline">ex2b-select-brown-family</span>
and <span class="underline">ex1b-map-children-to-value-1</span> can be composed together.
</p>

<p>
And as before, <b>transduce</b> is used to count (reduce) the number of children.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example 2b - using a transducer to count the children in the Brown family</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">create the transducer filter to select members of the Brown family</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex2b-select-brown-family</span> <span style="color: #8c8c8c;">(</span>filter #<span style="color: #8c8c8c;">(</span>= <span style="color: #8b2252;">"brown"</span> <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">string</span>/lower-case <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:family</span> <span style="color: #a0522d;">%</span><span style="color: #8c8c8c;">)))))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">compose a composite function to select the Brown family and map children to 1</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">NOTE: transducer comp functions are applied left-to-right</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex2b-count-brown-family-children</span> <span style="color: #8c8c8c;">(</span>comp ex2b-select-brown-family ex1b-map-children-to-value-1<span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">transduce to add up all the Brown children</span>
<span style="color: #8c8c8c;">(</span>transduce ex2b-count-brown-family-children + 0 village<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;;</span><span style="color: #006400;">=&gt;</span>
2
</pre>
</div>

<blockquote>
<p>
Note there is a gotcha here.  The functions in the composed
transducer ex2b-count-brown-family-children are
applied left-to-right not right-to-left as is usual with comp.
</p>
</blockquote>

<p>
Although not explicitly stated in Rich's
[post][HickeyBlogTransducers6Aug14] I guess <b>transducers</b>
do not create intermediate collections either.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Example 3 - how many children's names start with J?</h2>
<div class="outline-text-2" id="text-6">
<p>
We already know the answer:  just the 3 children in the <span class="underline">Jones</span> family.
</p>

<p>
Algorithmically, this is a three step pipeline: <span class="underline">filter</span> on children, a <span class="underline">filter</span> on
names beginning with "J" (or "j") and finally count of how many (children) in the result.
</p>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Example 3a - using a reducer to count children with names beginning with J</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example 3a - using a reducer to count children with names beginning with J</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">select (filter) just the children</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex3a-select-children</span> <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">r</span>/filter #<span style="color: #8c8c8c;">(</span>= <span style="color: #008b8b;">:child</span> <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:role</span> <span style="color: #a0522d;">%</span><span style="color: #8c8c8c;">))))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">select names beginning with "j"</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex3a-select-names-beginning-with-j</span> <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">r</span>/filter #<span style="color: #8c8c8c;">(</span>= <span style="color: #8b2252;">"j"</span> <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">string</span>/lower-case <span style="color: #8c8c8c;">(</span>first <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:name</span> <span style="color: #a0522d;">%</span><span style="color: #8c8c8c;">))))))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">In Example 1 we created the _map_ function</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">ex1a-map-children-to-value-1 to enable reduce to count the number</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">of children.</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">But the need to count the number of entries in a collection using</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">reduce, after a pipeline possibly involving many filters and</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">mappers, is a common one. This is straightforward to do, in the final</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">stage of the pipeline use a map function to transform each entry to</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">value 1.</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">map entries in a collection to 1</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex0a-map-to-value-1</span> <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">r</span>/map (fn [v] 1<span style="color: #8c8c8c;">)))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">create the three step count-children-with-names-beginning-j function</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex3a-count-children-with-names-beginning-j</span> <span style="color: #8c8c8c;">(</span>comp ex0a-map-to-value-1
                                                      ex3a-select-names-beginning-with-j
                                                      ex3a-select-children<span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">reduce the village with the ex32-count-children-with-names-beginning-j function</span>
<span style="color: #8c8c8c;">(</span><span style="color: #228b22;">r</span>/reduce + 0 <span style="color: #8c8c8c;">(</span>ex3a-count-children-with-names-beginning-j village<span style="color: #8c8c8c;">))</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
3
</pre>
</div>


<p>
Its worth labouring the point that composing the custom reducer <span class="underline">count-children-with-names-beginning-js</span> from
individual <span class="underline">filters</span> and <span class="underline">mappers</span> is a very powerful technique.
</p>
</div>
</div>
