doc/2014-08-08-Some-trivial-examples-of-using-Clojure-Transducers.org
** Example 3b - using a transducer to count children with names beginning with J

As with *transducers* map, _filter_ has a new arity, taking just the
filtering function, no collection.

#+BEGIN_SRC clojure :mkdirp yes :tangle ../src/main/clojure/transducer_examples1.clj
;; Example 3b - using a transducer to count children with names beginning with J

;; select (filter) just the children
(def ex3b-select-children (filter #(= :child (:role %))))

;; select names beginning with "j"
(def ex3b-select-names-beginning-with-j (filter #(= "j" (string/lower-case (first (:name %))))))

;; map entries in a collection to 1
(def ex0b-map-to-value-1 (map (fn [v] 1)))

;; create the three step count-children-with-names-beginning-j function
;; note the left-to-right order in which the indivudal transducers
(def ex3b-count-children-with-names-beginning-j (comp ex3b-select-children
                                                      ex3b-select-names-beginning-with-j
                                                      ex0b-map-to-value-1))

;; transduce the village with the ex3b-count-children-with-names-beginning-j transducer
(transduce ex3b-count-children-with-names-beginning-j + 0 village)
;; =>
3
#+END_SRC

#+BEGIN_QUOTE
Again, note the ex3b-count-children-with-names-beginning-j transducer
applies it constituent transducers left-to-right.
#+END_QUOTE

* Example 4 - creating a collection of children whose names start with J?

Sometimes you will want the resulting collection itself, post map,
filter, etc, and not reduced any further.

** Example 4a - using a reducer to create a collection of children whose names start with J?

Since we want the actual entries, rather than count them, we need a
pure filter pipeline, similar to Example 3 but one that *doesn't* use
the _ex0a-map-to-value-1_ mapper.

Creating a vector of the J children can be done simply by using _into_.

Under the covers _into_ uses _reduce_ so creating the vector is just a
matter of applying the
_ex4a-select-children-with-names-beginning-with-j_ reducers to the
village and then using the resulting collection with _into_ to create the vector.


#+BEGIN_SRC clojure :mkdirp yes :tangle ../src/main/clojure/transducer_examples1.clj
;; Example 4a - a reducer to create a collection of children whose names start with J?

;; create a reducing function to select (filter) children with names starting with "J"
(def ex4a-select-children-with-names-beginning-with-j (comp ex3a-select-names-beginning-with-j
                                                            ex3a-select-children))

;; use into to create a vector of the "J" children
(into [] (ex4a-select-children-with-names-beginning-with-j village))
;; =>
[{:age 19, :home :south, :name "jackie", :sex :f, :family "jones", :role :child}
 {:age 16, :home :south, :name "jason", :sex :f, :family "jones", :role :child}
 {:age 14, :home :south, :name "june", :sex :f, :family "jones", :role :child}]
#+END_SRC



** Example 4b - using a transducer to create a collection of children whose names start with J?

Very similar to *reducers*, *transducers* can use _into_ to create a
collection. 

#+BEGIN_QUOTE
Note _into_ takes the _transducer_ and the collection as arguments,
not just the collection.
#+END_QUOTE

#+BEGIN_SRC clojure :mkdirp yes :tangle ../src/main/clojure/transducer_examples1.clj
;; Example 4b - a transducer to create a collection of children whose names start with J?

;; create a reducing function to select (filter) children with names starting with "J"t
(def ex4b-select-children-with-names-beginning-with-j (comp ex3b-select-names-beginning-with-j
                                                            ex3b-select-children))

;; use into to create a vector of the "J" children
(into [] ex4b-select-children-with-names-beginning-with-j village)
;; =>
[{:age 19, :home :south, :name "jackie", :sex :f, :family "jones", :role :child}
 {:age 16, :home :south, :name "jason", :sex :f, :family "jones", :role :child}
 {:age 14, :home :south, :name "june", :sex :f, :family "jones", :role :child}]
#+END_SRC

* Example 5 - calculate the average age of children on or below the equator

A more involved, but still straightforward, example to finish this
section: what is the average age of the children who live on or below
the equator? By equator I mean where _home_ is East, South or West.

To do this, the value of _home_ will be mapped to a latitude and
longitude. For example West will be _:lat 0 :lng -180_ and South is
_:lat -90 :lng 0_.

