doc/2014-08-08-Some-trivial-examples-of-using-Clojure-Transducers.html
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Example 3b - using a transducer to count children with names beginning with J</h3>
<div class="outline-text-3" id="text-6-2">
<p>
As with <b>transducers</b> map, <span class="underline">filter</span> has a new arity, taking just the
filtering function, no collection.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example 3b - using a transducer to count children with names beginning with J</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">select (filter) just the children</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex3b-select-children</span> <span style="color: #8c8c8c;">(</span>filter #<span style="color: #8c8c8c;">(</span>= <span style="color: #008b8b;">:child</span> <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:role</span> <span style="color: #a0522d;">%</span><span style="color: #8c8c8c;">))))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">select names beginning with "j"</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex3b-select-names-beginning-with-j</span> <span style="color: #8c8c8c;">(</span>filter #<span style="color: #8c8c8c;">(</span>= <span style="color: #8b2252;">"j"</span> <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">string</span>/lower-case <span style="color: #8c8c8c;">(</span>first <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:name</span> <span style="color: #a0522d;">%</span><span style="color: #8c8c8c;">))))))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">map entries in a collection to 1</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex0b-map-to-value-1</span> <span style="color: #8c8c8c;">(</span>map (fn [v] 1<span style="color: #8c8c8c;">)))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">create the three step count-children-with-names-beginning-j function</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">note the left-to-right order in which the indivudal transducers</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex3b-count-children-with-names-beginning-j</span> <span style="color: #8c8c8c;">(</span>comp ex3b-select-children
                                                      ex3b-select-names-beginning-with-j
                                                      ex0b-map-to-value-1<span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">transduce the village with the ex3b-count-children-with-names-beginning-j transducer</span>
<span style="color: #8c8c8c;">(</span>transduce ex3b-count-children-with-names-beginning-j + 0 village<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
3
</pre>
</div>

<blockquote>
<p>
Again, note the ex3b-count-children-with-names-beginning-j transducer
applies it constituent transducers left-to-right.
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Example 4 - creating a collection of children whose names start with J?</h2>
<div class="outline-text-2" id="text-7">
<p>
Sometimes you will want the resulting collection itself, post map,
filter, etc, and not reduced any further.
</p>
</div>

<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Example 4a - using a reducer to create a collection of children whose names start with J?</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Since we want the actual entries, rather than count them, we need a
pure filter pipeline, similar to Example 3 but one that <b>doesn't</b> use
the <span class="underline">ex0a-map-to-value-1</span> mapper.
</p>

<p>
Creating a vector of the J children can be done simply by using <span class="underline">into</span>.
</p>

<p>
Under the covers <span class="underline">into</span> uses <span class="underline">reduce</span> so creating the vector is just a
matter of applying the
<span class="underline">ex4a-select-children-with-names-beginning-with-j</span> reducers to the
village and then using the resulting collection with <span class="underline">into</span> to create the vector.
</p>


<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example 4a - a reducer to create a collection of children whose names start with J?</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">create a reducing function to select (filter) children with names starting with "J"</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex4a-select-children-with-names-beginning-with-j</span> <span style="color: #8c8c8c;">(</span>comp ex3a-select-names-beginning-with-j
                                                            ex3a-select-children<span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">use into to create a vector of the "J" children</span>
<span style="color: #8c8c8c;">(</span>into [] <span style="color: #8c8c8c;">(</span>ex4a-select-children-with-names-beginning-with-j village<span style="color: #8c8c8c;">))</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
[{<span style="color: #008b8b;">:age</span> 19, <span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:south</span>, <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"jackie"</span>, <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:f</span>, <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"jones"</span>, <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:child</span>}
 {<span style="color: #008b8b;">:age</span> 16, <span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:south</span>, <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"jason"</span>, <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:f</span>, <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"jones"</span>, <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:child</span>}
 {<span style="color: #008b8b;">:age</span> 14, <span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:south</span>, <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"june"</span>, <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:f</span>, <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"jones"</span>, <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:child</span>}]
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Example 4b - using a transducer to create a collection of children whose names start with J?</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Very similar to <b>reducers</b>, <b>transducers</b> can use <span class="underline">into</span> to create a
collection. 
</p>

<blockquote>
<p>
Note <span class="underline">into</span> takes the <span class="underline">transducer</span> and the collection as arguments,
not just the collection.
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example 4b - a transducer to create a collection of children whose names start with J?</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">create a reducing function to select (filter) children with names starting with "J"t</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex4b-select-children-with-names-beginning-with-j</span> <span style="color: #8c8c8c;">(</span>comp ex3b-select-names-beginning-with-j
                                                            ex3b-select-children<span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">use into to create a vector of the "J" children</span>
<span style="color: #8c8c8c;">(</span>into [] ex4b-select-children-with-names-beginning-with-j village<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
[{<span style="color: #008b8b;">:age</span> 19, <span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:south</span>, <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"jackie"</span>, <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:f</span>, <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"jones"</span>, <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:child</span>}
 {<span style="color: #008b8b;">:age</span> 16, <span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:south</span>, <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"jason"</span>, <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:f</span>, <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"jones"</span>, <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:child</span>}
 {<span style="color: #008b8b;">:age</span> 14, <span style="color: #008b8b;">:home</span> <span style="color: #008b8b;">:south</span>, <span style="color: #008b8b;">:name</span> <span style="color: #8b2252;">"june"</span>, <span style="color: #008b8b;">:sex</span> <span style="color: #008b8b;">:f</span>, <span style="color: #008b8b;">:family</span> <span style="color: #8b2252;">"jones"</span>, <span style="color: #008b8b;">:role</span> <span style="color: #008b8b;">:child</span>}]
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Example 5 - calculate the average age of children on or below the equator</h2>
<div class="outline-text-2" id="text-8">
<p>
A more involved, but still straightforward, example to finish this
section: what is the average age of the children who live on or below
the equator? By equator I mean where <span class="underline">home</span> is East, South or West.
</p>

<p>
To do this, the value of <span class="underline">home</span> will be mapped to a latitude and
longitude. For example West will be <span class="underline">:lat 0 :lng -180</span> and South is
<span class="underline">:lat -90 :lng 0</span>.
</p>
</div>
