doc/2014-08-08-Some-trivial-examples-of-using-Clojure-Transducers.org
** Example 5a - using a reducer to calculate the average age of children on or below the equator

#+BEGIN_SRC clojure :mkdirp yes :tangle ../src/main/clojure/transducer_examples1.clj
;; Example 5a - using a reducer to calculate the average age of children on or below the equator

;; map :home to latitude and longitude
(def ex5a-map-home-to-latitude-and-longitude
  (r/map
   (fn [v]
     (condp = (:home v)
       :north (assoc v :lat 90 :lng 0)
       :south (assoc v :lat -90 :lng 0)
       :west (assoc v :lat 0 :lng -180)
       :east (assoc v :lat 0 :lng 180)))))


;; select people on or below the equator i.e. latitude <= 0
(def ex5a-select-people-on-or-below-equator (r/filter #(>= 0 (:lat %))))

;; To find the average age, we need to add up all the children's ages and
;; divide by how many children.

;; Note, rather than creating a composite pipeline function, in this example
;; the individual stages of the pipeline are used explicitly.

;; count the number of children on or below the equator
(def ex5a-no-children-on-or-below-the-equator
  (r/reduce + 0
          (ex0a-map-to-value-1
           (ex5a-select-people-on-or-below-equator
            (ex5a-map-home-to-latitude-and-longitude
             (ex3a-select-children village))))))


;; sum the ages of children
(def ex5a-select-age (r/map #(:age %)))

(def ex5a-sum-of-ages-of-children-on-or-below-the-equator
  (r/reduce + 0
          (ex5a-select-age
           (ex5a-select-people-on-or-below-equator
            (ex5a-map-home-to-latitude-and-longitude
             (ex3a-select-children village))))))


;; calculate the average age of children on or below the equator
(def ex5a-averge-age-of-children-on-or-below-the-equator
  (float (/ ex5a-sum-of-ages-of-children-on-or-below-the-equator ex5a-no-children-on-or-below-the-equator )))
;; =>
17.3
#+END_SRC

** Example 5b - using a transducer to calculate the average age of children on or below the equator

#+BEGIN_SRC clojure :mkdirp yes :tangle ../src/main/clojure/transducer_examples1.clj
;; Example 5b - using a transducer to calculate the average age of children on or below the equator

;; map :home to latitude and longitude
(def ex5b-map-home-to-latitude-and-longitude
  (map
   (fn [v]
     (condp = (:home v)
       :north (assoc v :lat 90 :lng 0)
       :south (assoc v :lat -90 :lng 0)
       :west (assoc v :lat 0 :lng -180)
       :east (assoc v :lat 0 :lng 180)))))


;; select people on or below the equator i.e. latitude <= 0
(def ex5b-select-people-on-or-below-equator (filter #(>= 0 (:lat %))))

;; create a "utility" transducer to select children on or below the equator
(def ex5b-select-children-on-or-below-the-equator
  (comp ex3b-select-children
        ex5b-map-home-to-latitude-and-longitude
        ex5b-select-people-on-or-below-equator)) 

;; create a transducer to count the number of children on or below the equator
(def ex5b-count-children-on-or-below-the-equator
  (comp ex5b-select-children-on-or-below-the-equator
        ex0b-map-to-value-1))

;; now count the number of children on or below the equator
(def ex5b-no-children-on-or-below-the-equator
  (transduce ex5b-count-children-on-or-below-the-equator + 0 village))

;; create a transducer to extract the age
(def ex5b-select-age (map #(:age %)))

;; create a transducer to extract the ages of all chilren
;; on or below the equator
(def ex5b-extract-ages-of-children-on-or-below-thew-equator
  (comp
   ex5b-select-children-on-or-below-the-equator
   ex5b-select-age))

;; now sum the ages
(def ex5b-sum-of-ages-of-children-on-or-below-the-equator
  (transduce ex5b-extract-ages-of-children-on-or-below-thew-equator + 0 village ))

;; calculate the average age of children on or below the equator
(def ex5b-averge-age-of-children-on-or-below-the-equator
  (float (/ ex5b-sum-of-ages-of-children-on-or-below-the-equator ex5b-no-children-on-or-below-the-equator)))
;; =>
17.3
#+END_SRC


