doc/2014-08-08-Some-trivial-examples-of-using-Clojure-Transducers.html

<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Example 5a - using a reducer to calculate the average age of children on or below the equator</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example 5a - using a reducer to calculate the average age of children on or below the equator</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">map :home to latitude and longitude</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex5a-map-home-to-latitude-and-longitude</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">r</span>/map
   (fn [v]
     <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">condp</span> = <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:home</span> v<span style="color: #8c8c8c;">)</span>
       <span style="color: #008b8b;">:north</span> <span style="color: #8c8c8c;">(</span>assoc v <span style="color: #008b8b;">:lat</span> 90 <span style="color: #008b8b;">:lng</span> 0<span style="color: #8c8c8c;">)</span>
       <span style="color: #008b8b;">:south</span> <span style="color: #8c8c8c;">(</span>assoc v <span style="color: #008b8b;">:lat</span> -90 <span style="color: #008b8b;">:lng</span> 0<span style="color: #8c8c8c;">)</span>
       <span style="color: #008b8b;">:west</span> <span style="color: #8c8c8c;">(</span>assoc v <span style="color: #008b8b;">:lat</span> 0 <span style="color: #008b8b;">:lng</span> -180<span style="color: #8c8c8c;">)</span>
       <span style="color: #008b8b;">:east</span> <span style="color: #8c8c8c;">(</span>assoc v <span style="color: #008b8b;">:lat</span> 0 <span style="color: #008b8b;">:lng</span> 180<span style="color: #8c8c8c;">)))))</span>


<span style="color: #006400;">;; </span><span style="color: #006400;">select people on or below the equator i.e. latitude &lt;= 0</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex5a-select-people-on-or-below-equator</span> <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">r</span>/filter #<span style="color: #8c8c8c;">(</span>&gt;= 0 <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:lat</span> <span style="color: #a0522d;">%</span><span style="color: #8c8c8c;">))))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">To find the average age, we need to add up all the children's ages and</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">divide by how many children.</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Note, rather than creating a composite pipeline function, in this example</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">the individual stages of the pipeline are used explicitly.</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">count the number of children on or below the equator</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex5a-no-children-on-or-below-the-equator</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">r</span>/reduce + 0
          <span style="color: #8c8c8c;">(</span>ex0a-map-to-value-1
           <span style="color: #8c8c8c;">(</span>ex5a-select-people-on-or-below-equator
            <span style="color: #8c8c8c;">(</span>ex5a-map-home-to-latitude-and-longitude
             <span style="color: #8c8c8c;">(</span>ex3a-select-children village<span style="color: #8c8c8c;">))))))</span>


<span style="color: #006400;">;; </span><span style="color: #006400;">sum the ages of children</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex5a-select-age</span> <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">r</span>/map #<span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:age</span> <span style="color: #a0522d;">%</span><span style="color: #8c8c8c;">)))</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex5a-sum-of-ages-of-children-on-or-below-the-equator</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">r</span>/reduce + 0
          <span style="color: #8c8c8c;">(</span>ex5a-select-age
           <span style="color: #8c8c8c;">(</span>ex5a-select-people-on-or-below-equator
            <span style="color: #8c8c8c;">(</span>ex5a-map-home-to-latitude-and-longitude
             <span style="color: #8c8c8c;">(</span>ex3a-select-children village<span style="color: #8c8c8c;">))))))</span>


<span style="color: #006400;">;; </span><span style="color: #006400;">calculate the average age of children on or below the equator</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex5a-averge-age-of-children-on-or-below-the-equator</span>
  <span style="color: #8c8c8c;">(</span>float <span style="color: #8c8c8c;">(</span>/ ex5a-sum-of-ages-of-children-on-or-below-the-equator ex5a-no-children-on-or-below-the-equator <span style="color: #8c8c8c;">)))</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
17.3
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Example 5b - using a transducer to calculate the average age of children on or below the equator</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example 5b - using a transducer to calculate the average age of children on or below the equator</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">map :home to latitude and longitude</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex5b-map-home-to-latitude-and-longitude</span>
  <span style="color: #8c8c8c;">(</span>map
   (fn [v]
     <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">condp</span> = <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:home</span> v<span style="color: #8c8c8c;">)</span>
       <span style="color: #008b8b;">:north</span> <span style="color: #8c8c8c;">(</span>assoc v <span style="color: #008b8b;">:lat</span> 90 <span style="color: #008b8b;">:lng</span> 0<span style="color: #8c8c8c;">)</span>
       <span style="color: #008b8b;">:south</span> <span style="color: #8c8c8c;">(</span>assoc v <span style="color: #008b8b;">:lat</span> -90 <span style="color: #008b8b;">:lng</span> 0<span style="color: #8c8c8c;">)</span>
       <span style="color: #008b8b;">:west</span> <span style="color: #8c8c8c;">(</span>assoc v <span style="color: #008b8b;">:lat</span> 0 <span style="color: #008b8b;">:lng</span> -180<span style="color: #8c8c8c;">)</span>
       <span style="color: #008b8b;">:east</span> <span style="color: #8c8c8c;">(</span>assoc v <span style="color: #008b8b;">:lat</span> 0 <span style="color: #008b8b;">:lng</span> 180<span style="color: #8c8c8c;">)))))</span>


<span style="color: #006400;">;; </span><span style="color: #006400;">select people on or below the equator i.e. latitude &lt;= 0</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex5b-select-people-on-or-below-equator</span> <span style="color: #8c8c8c;">(</span>filter #<span style="color: #8c8c8c;">(</span>&gt;= 0 <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:lat</span> <span style="color: #a0522d;">%</span><span style="color: #8c8c8c;">))))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">create a "utility" transducer to select children on or below the equator</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex5b-select-children-on-or-below-the-equator</span>
  <span style="color: #8c8c8c;">(</span>comp ex3b-select-children
        ex5b-map-home-to-latitude-and-longitude
        ex5b-select-people-on-or-below-equator<span style="color: #8c8c8c;">))</span> 

<span style="color: #006400;">;; </span><span style="color: #006400;">create a transducer to count the number of children on or below the equator</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex5b-count-children-on-or-below-the-equator</span>
  <span style="color: #8c8c8c;">(</span>comp ex5b-select-children-on-or-below-the-equator
        ex0b-map-to-value-1<span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">now count the number of children on or below the equator</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex5b-no-children-on-or-below-the-equator</span>
  <span style="color: #8c8c8c;">(</span>transduce ex5b-count-children-on-or-below-the-equator + 0 village<span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">create a transducer to extract the age</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex5b-select-age</span> <span style="color: #8c8c8c;">(</span>map #<span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:age</span> <span style="color: #a0522d;">%</span><span style="color: #8c8c8c;">)))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">create a transducer to extract the ages of all chilren</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">on or below the equator</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex5b-extract-ages-of-children-on-or-below-thew-equator</span>
  <span style="color: #8c8c8c;">(</span>comp
   ex5b-select-children-on-or-below-the-equator
   ex5b-select-age<span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">now sum the ages</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex5b-sum-of-ages-of-children-on-or-below-the-equator</span>
  <span style="color: #8c8c8c;">(</span>transduce ex5b-extract-ages-of-children-on-or-below-thew-equator + 0 village <span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">calculate the average age of children on or below the equator</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex5b-averge-age-of-children-on-or-below-the-equator</span>
  <span style="color: #8c8c8c;">(</span>float <span style="color: #8c8c8c;">(</span>/ ex5b-sum-of-ages-of-children-on-or-below-the-equator ex5b-no-children-on-or-below-the-equator<span style="color: #8c8c8c;">)))</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
17.3
</pre>
</div>
</div>
</div>
</div>
