doc/2014-08-08-Some-trivial-examples-of-using-Clojure-Transducers.org
* Example 6 - comparing the performance of reducers and transducers

Lets time the addition of the ages from Example 5 using *reducers*
 _reduce_ and _fold_, and *transducers* _transduce_.

** Example 6a - time a reducer adding up Example 5's ages

#+BEGIN_SRC clojure :mkdirp yes :tangle ../src/main/clojure/transducer_examples1.clj
;; Example 6a - time a reducer adding up Example 5's ages

;; time reducer adding up Example 5's ages
(time (dotimes [n 100000] (r/reduce +
                                  (ex5a-select-age
                                   (ex5a-select-people-on-or-below-equator
                                    (ex5a-map-home-to-latitude-and-longitude
                                     (ex3a-select-children village)))))))
;; =>
"Elapsed time: ~700 msecs"

;; time fold adding up Example 5's ages
(time (dotimes [n 100000] (r/fold +
                               (ex5a-select-age
                                (ex5a-select-people-on-or-below-equator
                                 (ex5a-map-home-to-latitude-and-longitude
                                  (ex3a-select-children village)))))))
;; =>
"Elapsed time: ~700 msecs"
#+END_SRC

Its not possible to see the benefits on _fold's_ ability to
parallelise on this volume of data (village).

** Example 6b - time a transducer adding up Example 5's ages

#+BEGIN_SRC clojure :mkdirp yes :tangle ../src/main/clojure/transducer_examples1.clj
;; Example 6b - time a transducer adding up Example 5's ages

(time (dotimes [n 100000] (transduce ex5b-extract-ages-of-children-on-or-below-thew-equator + 0 village)))
;; =>
"Elapsed time: ~700 msecs"
#+END_SRC

So, in this example, its not possible to see any performance difference between *reducers* and *transducers*.


* Example 7 - all the relatives visit the village!

Its that time of year again and all the relatives of the families in the village visit and
the population of the village swells enormously to 10 million people.

** Example 7 - make some visitors

Lets define some functions to create an influx of visitors. _Note, no attempt has been made to ensure this randomly generated data makes any sort of real world sense - it could include e.g. a child of age 100._

#+BEGIN_SRC clojure :mkdirp yes :tangle ../src/main/clojure/transducer_examples1.clj
;; Example 7 - make some visitors

(def ex7-fn-random-name (fn [] (rand-nth ["chris" "jim" "mark" "jon" "lisa" "kate" "jay" "june" "julie" "laura"])))
(def ex7-fn-random-family (fn [] (rand-nth ["smith" "jones" "brown" "williams" "taylor" "davies"])))
(def ex7-fn-random-home (fn [] (rand-nth [:north :south :east :west])))
(def ex7-fn-random-sex (fn [] (rand-nth [:m :f])))
(def ex7-fn-random-role (fn [] (rand-nth [:child :parent])))
(def ex7-fn-random-age (fn [] (rand-int 100)))

(def ex7-visitor-template
  {:home ex7-fn-random-home
   :family ex7-fn-random-family
   :name ex7-fn-random-name
   :age ex7-fn-random-age
   :sex ex7-fn-random-sex
   :role ex7-fn-random-role})

(defn ex7-make-visitor [] (into {} (for [[k v] ex7-visitor-template] [k (v)])))

(defn ex7-make-visitors [n] (take n (repeatedly ex7-make-visitor)))

(def ex7-visitors (into [] (ex7-make-visitors 10000000)))
#+END_SRC

#+BEGIN_SRC clojure :mkdirp yes :exports none :tangle ../src/main/clojure/transducer_examples1.clj
;; Example 7 - make some visitors

(def ex7-fn-random-name (fn [] (rand-nth ["chris" "jim" "mark" "jon" "lisa" "kate" "jay" "june" "julie" "laura"])))
(def ex7-fn-random-family (fn [] (rand-nth ["smith" "jones" "brown" "williams" "taylor" "davies"])))
(def ex7-fn-random-home (fn [] (rand-nth [:north :south :east :west])))
(def ex7-fn-random-sex (fn [] (rand-nth [:m :f])))
(def ex7-fn-random-role (fn [] (rand-nth [:child :parent])))
(def ex7-fn-random-age (fn [] (rand-int 100)))

(def ex7-visitor-template
  {:home ex7-fn-random-home
   :family ex7-fn-random-family
   :name ex7-fn-random-name
   :age ex7-fn-random-age
   :sex ex7-fn-random-sex
   :role ex7-fn-random-role})

(defn ex7-make-visitor [] (into {} (for [[k v] ex7-visitor-template] [k (v)])))

(defn ex7-make-visitors [n] (take n (repeatedly ex7-make-visitor)))

(def ex7-visitors (into [] (ex7-make-visitors 10000000)))
#+END_SRC

** Example 7a - using reducers to count the visiting Brown children

#+BEGIN_SRC clojure :mkdirp yes :tangle ../src/main/clojure/transducer_examples1.clj
;; Example 7a - using reducers count the visiting Brown children

;; count the visiting Brown children using reduce
(time (r/reduce + 0 (ex2a-count-brown-family-children ex7-visitors)))
;; =>
"Elapsed time: ~1600 msecs"

;; count the visiting Brown children using fold
(time (r/fold + (ex2a-count-brown-family-children ex7-visitors)))
;; =>
"Elapsed time: ~555 msecs"
#+END_SRC

