doc/2014-08-08-Some-trivial-examples-of-using-Clojure-Transducers.html

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Example 6 - comparing the performance of reducers and transducers</h2>
<div class="outline-text-2" id="text-9">
<p>
Lets time the addition of the ages from Example 5 using <b>reducers</b>
 <span class="underline">reduce</span> and <span class="underline">fold</span>, and <b>transducers</b> <span class="underline">transduce</span>.
</p>
</div>

<div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Example 6a - time a reducer adding up Example 5's ages</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example 6a - time a reducer adding up Example 5's ages</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">time reducer adding up Example 5's ages</span>
<span style="color: #8c8c8c;">(</span>time <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">dotimes</span> [n 100000] <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">r</span>/reduce +
                                  <span style="color: #8c8c8c;">(</span>ex5a-select-age
                                   <span style="color: #8c8c8c;">(</span>ex5a-select-people-on-or-below-equator
                                    <span style="color: #8c8c8c;">(</span>ex5a-map-home-to-latitude-and-longitude
                                     <span style="color: #8c8c8c;">(</span>ex3a-select-children village<span style="color: #8c8c8c;">)))))))</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
<span style="color: #8b2252;">"Elapsed time: ~700 msecs"</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">time fold adding up Example 5's ages</span>
<span style="color: #8c8c8c;">(</span>time <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">dotimes</span> [n 100000] <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">r</span>/fold +
                               <span style="color: #8c8c8c;">(</span>ex5a-select-age
                                <span style="color: #8c8c8c;">(</span>ex5a-select-people-on-or-below-equator
                                 <span style="color: #8c8c8c;">(</span>ex5a-map-home-to-latitude-and-longitude
                                  <span style="color: #8c8c8c;">(</span>ex3a-select-children village<span style="color: #8c8c8c;">)))))))</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
<span style="color: #8b2252;">"Elapsed time: ~700 msecs"</span>
</pre>
</div>

<p>
Its not possible to see the benefits on <span class="underline">fold's</span> ability to
parallelise on this volume of data (village).
</p>
</div>
</div>
<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> Example 6b - time a transducer adding up Example 5's ages</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example 6b - time a transducer adding up Example 5's ages</span>

<span style="color: #8c8c8c;">(</span>time <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">dotimes</span> [n 100000] <span style="color: #8c8c8c;">(</span>transduce ex5b-extract-ages-of-children-on-or-below-thew-equator + 0 village<span style="color: #8c8c8c;">)))</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
<span style="color: #8b2252;">"Elapsed time: ~700 msecs"</span>
</pre>
</div>

<p>
So, in this example, its not possible to see any performance difference between <b>reducers</b> and <b>transducers</b>.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Example 7 - all the relatives visit the village!</h2>
<div class="outline-text-2" id="text-10">
<p>
Its that time of year again and all the relatives of the families in the village visit and
the population of the village swells enormously to 10 million people.
</p>
</div>

<div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> Example 7 - make some visitors</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Lets define some functions to create an influx of visitors. <span class="underline">Note, no attempt has been made to ensure this randomly generated data makes any sort of real world sense - it could include e.g. a child of age 100.</span>
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example 7 - make some visitors</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex7-fn-random-name</span> (fn [] <span style="color: #8c8c8c;">(</span>rand-nth [<span style="color: #8b2252;">"chris"</span> <span style="color: #8b2252;">"jim"</span> <span style="color: #8b2252;">"mark"</span> <span style="color: #8b2252;">"jon"</span> <span style="color: #8b2252;">"lisa"</span> <span style="color: #8b2252;">"kate"</span> <span style="color: #8b2252;">"jay"</span> <span style="color: #8b2252;">"june"</span> <span style="color: #8b2252;">"julie"</span> <span style="color: #8b2252;">"laura"</span>]<span style="color: #8c8c8c;">)))</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex7-fn-random-family</span> (fn [] <span style="color: #8c8c8c;">(</span>rand-nth [<span style="color: #8b2252;">"smith"</span> <span style="color: #8b2252;">"jones"</span> <span style="color: #8b2252;">"brown"</span> <span style="color: #8b2252;">"williams"</span> <span style="color: #8b2252;">"taylor"</span> <span style="color: #8b2252;">"davies"</span>]<span style="color: #8c8c8c;">)))</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex7-fn-random-home</span> (fn [] <span style="color: #8c8c8c;">(</span>rand-nth [<span style="color: #008b8b;">:north</span> <span style="color: #008b8b;">:south</span> <span style="color: #008b8b;">:east</span> <span style="color: #008b8b;">:west</span>]<span style="color: #8c8c8c;">)))</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex7-fn-random-sex</span> (fn [] <span style="color: #8c8c8c;">(</span>rand-nth [<span style="color: #008b8b;">:m</span> <span style="color: #008b8b;">:f</span>]<span style="color: #8c8c8c;">)))</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex7-fn-random-role</span> (fn [] <span style="color: #8c8c8c;">(</span>rand-nth [<span style="color: #008b8b;">:child</span> <span style="color: #008b8b;">:parent</span>]<span style="color: #8c8c8c;">)))</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex7-fn-random-age</span> (fn [] <span style="color: #8c8c8c;">(</span>rand-int 100<span style="color: #8c8c8c;">)))</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex7-visitor-template</span>
  {<span style="color: #008b8b;">:home</span> ex7-fn-random-home
   <span style="color: #008b8b;">:family</span> ex7-fn-random-family
   <span style="color: #008b8b;">:name</span> ex7-fn-random-name
   <span style="color: #008b8b;">:age</span> ex7-fn-random-age
   <span style="color: #008b8b;">:sex</span> ex7-fn-random-sex
   <span style="color: #008b8b;">:role</span> ex7-fn-random-role}<span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">ex7-make-visitor</span> [] <span style="color: #8c8c8c;">(</span>into {} <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">for</span> [[k v] ex7-visitor-template] [k <span style="color: #8c8c8c;">(</span>v<span style="color: #8c8c8c;">)</span>]<span style="color: #8c8c8c;">)))</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">ex7-make-visitors</span> [n] <span style="color: #8c8c8c;">(</span>take n <span style="color: #8c8c8c;">(</span>repeatedly ex7-make-visitor<span style="color: #8c8c8c;">)))</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #a0522d;">ex7-visitors</span> <span style="color: #8c8c8c;">(</span>into [] <span style="color: #8c8c8c;">(</span>ex7-make-visitors 10000000<span style="color: #8c8c8c;">)))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> Example 7a - using reducers to count the visiting Brown children</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example 7a - using reducers count the visiting Brown children</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">count the visiting Brown children using reduce</span>
<span style="color: #8c8c8c;">(</span>time <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">r</span>/reduce + 0 <span style="color: #8c8c8c;">(</span>ex2a-count-brown-family-children ex7-visitors<span style="color: #8c8c8c;">)))</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
<span style="color: #8b2252;">"Elapsed time: ~1600 msecs"</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">count the visiting Brown children using fold</span>
<span style="color: #8c8c8c;">(</span>time <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">r</span>/fold + <span style="color: #8c8c8c;">(</span>ex2a-count-brown-family-children ex7-visitors<span style="color: #8c8c8c;">)))</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
<span style="color: #8b2252;">"Elapsed time: ~555 msecs"</span>
</pre>
</div>
</div>
</div>
