doc/2014-08-08-Some-trivial-examples-of-using-Clojure-Transducers.org
** Example 7b - using transducers to count the visiting Brown children

#+BEGIN_SRC clojure :mkdirp yes :tangle ../src/main/clojure/transducer_examples1.clj
;; Example 7b - using reducers count the visiting Brown children

;; count the visiting Brown children using transduce
(time (transduce ex2b-count-brown-family-children + 0 ex7-visitors))
;; =>
"Elapsed time: ~1640 msecs"
#+END_SRC

** Example 7c - using core map, filter and reduce to count the visiting Brown children

How do the *reducers* and *transducers* fare against *core* reduce?

#+BEGIN_SRC clojure :mkdirp yes :tangle ../src/main/clojure/transducer_examples1.clj
;; Example 7c - using core map, filter and reduce to count the visiting Brown children

;; count the visiting Brown children using core map, filter and reduce
(time (reduce + 0
              (map #(if (= :child (:role %)) 1 0)
                   (filter #(= "brown" (string/lower-case (:family %))) ex7-visitors))))

;; =>
"Elapsed time: ~2000 msecs"
#+END_SRC

In the original [reducers post][RumfordBlogTrivialReducers17Nov12] I
found *reducers* _fold_ was nearly four times faster than *reducers*
_reduce_. Here _fold_ is about three times faster. (I'm using the same
four core workstation.)

*Transducers* come out with around the same time as *reducers* reduce.

_All these numbers should be taken with a large pinch of salt, they
are just a "wet finger" and this is in no way a rigorous benchmark._


* Final Words

I've only scratched the surface of *transducers* in this post of
course and Rich's [post][HickeyBlogTransducers6Aug14] has opened only
a crack in the door to understanding the potential of *transducers*;
there will be more to come,
appreciate and learn I'm sure.

So far I've found *transducers* more immediately understandable than I
did *reducers*, maybe because I already have a reasonable grasp of the
latter and  some existing mental context to understand the former. It
will be interesting to hear / learn how other people new to both
_grok_ *transducers*.

I've been doing a project using *reducers* _fold_ for the parallisation
benefits and have noticed I have needed to consciously mentally "switch" between the
*core* world and *reducers* world. In that sense I think *reducers*
have an "impedance mismatch" with the rest of *core*. 

On the other
hands, writing the examples above I've felt *transducers*
are more "grounded" with *core*; indeed they are *core* (there is no *transducers*
namespace).

To sum up my opinion in a pithy one-liner: *transducers* are *reducers* decomplected.

#+BEGIN_SRC clojure :mkdirp yes :exports none :tangle ../src/main/clojure/transducer_examples1.clj
(defn -main
  [& args])
#+END_SRC

#+BEGIN_SRC clojure :mkdirp yes :exports none :tangle ../project.clj
(defproject name.rumford/transducers-examples "0.1.0"
  :description "Some trivial examples of using Clojure Transducers"
  :url "http://ianrumford.github.io/blog/2014/08/08/Some-trivial-examples-of-using-Clojure-Transducers/"
  :license {:name "MIT" :url "http://opensource.org/licenses/MIT"}
  :dependencies [[org.clojure/clojure "1.7.0-alpha1"]]
  :source-paths ["src/main/clojure"]
  :test-paths   ["src/test/clojure"])
#+END_SRC

#+BEGIN_SRC
[ClojureHome]: http:///clojure.org
[JavaHome]: http://www.java.com
[LeiningenHome]: http://leiningen.org/
[LeiningenGithub]: https://github.com/technomancy/leiningen
[MavenHome]: http://maven.apache.org/
[ClojarsHome]: http://clojars.org
[RumfordGithubClojureTransducerExamples]: https://github.com/ianrumford/clojure-transducer-examples
[RumfordBlogClojureCoreContractsFirstTake]: http://ianrumford.github.io/blog/2012/11/17/first-take-on-contracts-in-clojure/
[RumfordBlogTrivialReducers17Nov12]: http://ianrumford.github.io/blog/2013/08/25/some-trivial-examples-of-using-clojure-reducers/
[FogusHome]: http://blog.fogus.me
[LaddadBookAspectJinAction]: http://www.manning.com/laddad/
[LaddadTwitter]: https://twitter.com/ramnivas
[KiczalesHome]: http://people.cs.ubc.ca/~gregor/
[EmerickHome]: http://cemerick.com/
[GrandHome]: http://clj-me.cgrand.net/
[CarperHome]: http://briancarper.net/
[ClojureProgrammingBook]: http://www.clojurebook.com/
[emacshome]: http://www.gnu.org/software/emacs/
[ClojureGithubReducers]: https://github.com/clojure/clojure/blob/master/src/clj/clojure/core/reducers.clj
[Leiningen]: https://github.com/technomancy/leiningen
[HickeyBlogReducers18May12]: http://clojure.com/blog/2012/05/08/reducers-a-library-and-model-for-collection-processing.html
[HickeyBlogReducers215May12]: http://clojure.com/blog/2012/05/15/anatomy-of-reducer.html
[HickeyBlogTransducers6Aug14]: http://blog.cognitect.com/blog/2014/8/6/transducers-are-coming
[Clojure Reducers Code]: https://gist.github.com/ianrumford/6333358
[HickeyTwitter]: https://twitter.com/richhickey
[LeonardoBorges]: http://www.slideshare.net/borgesleonardo/clojure-reducers-cljsyd-aug-2012?ref=http://www.leonardoborges.com/writings/presentations/
[AssociativeProperty]: http://en.wikipedia.org/wiki/Associative_property
[SimpleNotEasy]: http://www.infoq.com/presentations/Simple-Made-Easy
#+END_SRC
