doc/2014-08-08-Some-trivial-examples-of-using-Clojure-Transducers.html
<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> Example 7b - using transducers to count the visiting Brown children</h3>
<div class="outline-text-3" id="text-10-3">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example 7b - using reducers count the visiting Brown children</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">count the visiting Brown children using transduce</span>
<span style="color: #8c8c8c;">(</span>time <span style="color: #8c8c8c;">(</span>transduce ex2b-count-brown-family-children + 0 ex7-visitors<span style="color: #8c8c8c;">))</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
<span style="color: #8b2252;">"Elapsed time: ~1640 msecs"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-10-4" class="outline-3">
<h3 id="sec-10-4"><span class="section-number-3">10.4</span> Example 7c - using core map, filter and reduce to count the visiting Brown children</h3>
<div class="outline-text-3" id="text-10-4">
<p>
How do the <b>reducers</b> and <b>transducers</b> fare against <b>core</b> reduce?
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example 7c - using core map, filter and reduce to count the visiting Brown children</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">count the visiting Brown children using core map, filter and reduce</span>
<span style="color: #8c8c8c;">(</span>time <span style="color: #8c8c8c;">(</span>reduce + 0
              <span style="color: #8c8c8c;">(</span>map #<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">if</span> <span style="color: #8c8c8c;">(</span>= <span style="color: #008b8b;">:child</span> <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:role</span> <span style="color: #a0522d;">%</span><span style="color: #8c8c8c;">))</span> 1 0<span style="color: #8c8c8c;">)</span>
                   <span style="color: #8c8c8c;">(</span>filter #<span style="color: #8c8c8c;">(</span>= <span style="color: #8b2252;">"brown"</span> <span style="color: #8c8c8c;">(</span><span style="color: #228b22;">string</span>/lower-case <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:family</span> <span style="color: #a0522d;">%</span><span style="color: #8c8c8c;">)))</span> ex7-visitors<span style="color: #8c8c8c;">))))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
<span style="color: #8b2252;">"Elapsed time: ~2000 msecs"</span>
</pre>
</div>

<p>
In the original [reducers post][RumfordBlogTrivialReducers17Nov12] I
found <b>reducers</b> <span class="underline">fold</span> was nearly four times faster than <b>reducers</b>
<span class="underline">reduce</span>. Here <span class="underline">fold</span> is about three times faster. (I'm using the same
four core workstation.)
</p>

<p>
<b>Transducers</b> come out with around the same time as <b>reducers</b> reduce.
</p>

<p>
<span class="underline">All these numbers should be taken with a large pinch of salt, they
are just a "wet finger" and this is in no way a rigorous benchmark.</span>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Final Words</h2>
<div class="outline-text-2" id="text-11">
<p>
I've only scratched the surface of <b>transducers</b> in this post of
course and Rich's [post][HickeyBlogTransducers6Aug14] has opened only
a crack in the door to understanding the potential of <b>transducers</b>;
there will be more to come,
appreciate and learn I'm sure.
</p>

<p>
So far I've found <b>transducers</b> more immediately understandable than I
did <b>reducers</b>, maybe because I already have a reasonable grasp of the
latter and  some existing mental context to understand the former. It
will be interesting to hear / learn how other people new to both
<span class="underline">grok</span> <b>transducers</b>.
</p>

<p>
I've been doing a project using <b>reducers</b> <span class="underline">fold</span> for the parallisation
benefits and have noticed I have needed to consciously mentally "switch" between the
<b>core</b> world and <b>reducers</b> world. In that sense I think <b>reducers</b>
have an "impedance mismatch" with the rest of <b>core</b>. 
</p>

<p>
On the other
hands, writing the examples above I've felt <b>transducers</b>
are more "grounded" with <b>core</b>; indeed they are <b>core</b> (there is no <b>transducers</b>
namespace).
</p>

<p>
To sum up my opinion in a pithy one-liner: <b>transducers</b> are <b>reducers</b> decomplected.
</p>

<pre class="example">
[ClojureHome]: http:///clojure.org
[JavaHome]: http://www.java.com
[LeiningenHome]: http://leiningen.org/
[LeiningenGithub]: https://github.com/technomancy/leiningen
[MavenHome]: http://maven.apache.org/
[ClojarsHome]: http://clojars.org
[RumfordGithubClojureTransducerExamples]: https://github.com/ianrumford/clojure-transducer-examples
[RumfordBlogClojureCoreContractsFirstTake]: http://ianrumford.github.io/blog/2012/11/17/first-take-on-contracts-in-clojure/
[RumfordBlogTrivialReducers17Nov12]: http://ianrumford.github.io/blog/2013/08/25/some-trivial-examples-of-using-clojure-reducers/
[FogusHome]: http://blog.fogus.me
[LaddadBookAspectJinAction]: http://www.manning.com/laddad/
[LaddadTwitter]: https://twitter.com/ramnivas
[KiczalesHome]: http://people.cs.ubc.ca/~gregor/
[EmerickHome]: http://cemerick.com/
[GrandHome]: http://clj-me.cgrand.net/
[CarperHome]: http://briancarper.net/
[ClojureProgrammingBook]: http://www.clojurebook.com/
[emacshome]: http://www.gnu.org/software/emacs/
[ClojureGithubReducers]: https://github.com/clojure/clojure/blob/master/src/clj/clojure/core/reducers.clj
[Leiningen]: https://github.com/technomancy/leiningen
[HickeyBlogReducers18May12]: http://clojure.com/blog/2012/05/08/reducers-a-library-and-model-for-collection-processing.html
[HickeyBlogReducers215May12]: http://clojure.com/blog/2012/05/15/anatomy-of-reducer.html
[HickeyBlogTransducers6Aug14]: http://blog.cognitect.com/blog/2014/8/6/transducers-are-coming
[Clojure Reducers Code]: https://gist.github.com/ianrumford/6333358
[HickeyTwitter]: https://twitter.com/richhickey
[LeonardoBorges]: http://www.slideshare.net/borgesleonardo/clojure-reducers-cljsyd-aug-2012?ref=http://www.leonardoborges.com/writings/presentations/
[AssociativeProperty]: http://en.wikipedia.org/wiki/Associative_property
[SimpleNotEasy]: http://www.infoq.com/presentations/Simple-Made-Easy
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ian Rumford</p>
<p class="date">Created: 2014-08-08 Fri 15:01</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.6)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
